# Pandas IO

## Criando os nomes

In [40]:
import pandas as pd # noqa E402

In [41]:
# Se precisar recriar as listas no de nomes, descomente o código abaixo
# e execute.

# nomes = pd.read_csv('../data/nomes.csv')
# nomes.head(10)

# selecao_m = nomes['classification'] == 'M'
# nomes_masculinos = nomes[selecao_m][['first_name']]
# nomes_masculinos.reset_index(drop=True, inplace=True)
# nomes_masculinos.rename(columns={'first_name': 'nome'}, inplace=True)
# nomes_masculinos['nome'] = nomes_masculinos['nome'].str.capitalize()
# nomes_masculinos.to_csv('../data/nomes_m.csv', index=False)

# selecao_f = nomes['classification'] == 'F'
# nomes_femininos = nomes[selecao_f][['first_name']]
# nomes_femininos.reset_index(drop=True, inplace=True)
# nomes_femininos.rename(columns={'first_name': 'nome'}, inplace=True)
# nomes_femininos['nome'] = nomes_femininos['nome'].str.capitalize()
# nomes_femininos.to_csv('../data/nomes_f.csv', index=False)

In [42]:
# nomes_m = pd.read_json(
#     'https://servicodados.ibge.gov.br/api/v1/censos/nomes/'
#     + 'ranking?qtd=200&sexo=m'
# )

# Quando o serviço acima estiver indisponível, use o código abaixo:
nomes_m = pd.read_csv('../data/nomes_m.csv')
nomes_m = nomes_m.sample(200)
nomes_m.reset_index(drop=True, inplace=True)

# nomes_f = pd.read_json(
#     'https://servicodados.ibge.gov.br/api/v1/censos/nomes/'
#     + 'ranking?qtd=200&sexo=f'
# )

# Quando o serviço acima estiver indisponível, use o código abaixo:
nomes_f = pd.read_csv('../data/nomes_f.csv')
nomes_f = nomes_f.sample(200)
nomes_f.reset_index(drop=True, inplace=True)

In [43]:
nomes_m.head(10)

         nome
0       Adavi
1        Abni
2     Hueslei
3     Flausio
4      Mathan
5    Gerlivan
6     Mychell
7  Dyefferson
8     Carleto
9      Oswald

In [44]:
nomes_f.head(10)

         nome
0  Filadelfia
1    Macelane
2       Darly
3      Niracy
4        Lena
5    Leidieli
6     Sanmara
7      Katlym
8    Tasciana
9      Raelem

In [45]:
print(f'Quantidade de nomes: {len(nomes_m) + len(nomes_f)}')

Quantidade de nomes: 400

In [46]:
frames = [nomes_m.sample(200), nomes_f.sample(200)]

In [47]:
type(pd.concat(frames)['nome'])

pandas.core.series.Series

In [48]:
nomes = pd.concat(frames)['nome'].to_frame()

In [49]:
nomes

          nome
143  Elivander
68       Iugui
93     Lenildo
21       Olice
57     Ivelton
..         ...
104   Lucassia
64      Mailta
180    Thuanni
170    Valnisa
133   Edinaele

[400 rows x 1 columns]

In [50]:
nomes = nomes.sample(nomes.shape[0])
nomes.reset_index(drop=True, inplace=True)
nomes

          nome
0    Francinny
1      Jocelis
2    Nerlandia
3     Lindraci
4       Mailta
..         ...
395   Abisalao
396  Werlandia
397      Adavi
398      Lorni
399     Reneci

[400 rows x 1 columns]

## incluindo ID dos alunos

In [51]:
import numpy as np # noqa E402
np.random.seed(123)

In [52]:
total_alunos = nomes.shape[0]
total_alunos

400

In [53]:
nomes['id_aluno'] = np.random.permutation(total_alunos) + 1

In [54]:
nomes.sample(5)

         nome  id_aluno
188  Tatianna       369
57   Jercione       303
203    Selbia       382
382    Aurani        33
230    Calleb       111

In [55]:
dominios = ['@dominiodoemail.com.br', '@servicodoemail.com']
nomes['dominio'] = np.random.choice(dominios, total_alunos)

In [56]:
nomes

          nome  id_aluno                 dominio
0    Francinny       235  @dominiodoemail.com.br
1      Jocelis        43     @servicodoemail.com
2    Nerlandia       304     @servicodoemail.com
3     Lindraci       156  @dominiodoemail.com.br
4       Mailta       343     @servicodoemail.com
..         ...       ...                     ...
395   Abisalao       231  @dominiodoemail.com.br
396  Werlandia        99     @servicodoemail.com
397      Adavi       323  @dominiodoemail.com.br
398      Lorni       383  @dominiodoemail.com.br
399     Reneci       366     @servicodoemail.com

[400 rows x 3 columns]

In [57]:
nomes['email'] = nomes['nome'].str.cat(nomes.dominio).str.lower()
nomes

,nome,id_aluno,dominio,email
0,Francinny,235,@dominiodoemail.com.br,francinny@dominiodoemail.com.br
1,Jocelis,43,@servicodoemail.com,jocelis@servicodoemail.com
2,Nerlandia,304,@servicodoemail.com,nerlandia@servicodoemail.com
3,Lindraci,156,@dominiodoemail.com.br,lindraci@dominiodoemail.com.br
4,Mailta,343,@servicodoemail.com,mailta@servicodoemail.com
...,...,...,...,...
395,Abisalao,231,@dominiodoemail.com.br,abisalao@dominiodoemail.com.br
396,Werlandia,99,@servicodoemail.com,werlandia@servicodoemail.com
397,Adavi,323,@dominiodoemail.com.br,adavi@dominiodoemail.com.br
398,Lorni,383,@dominiodoemail.com.br,lorni@dominiodoemail.com.br
399,Reneci,366,@servicodoemail.com,reneci@servicodoemail.com

In [58]:
type(np.random)

module

## Criando a tabela de Cursos

In [59]:
import html5lib # noqa E402

In [60]:
url = 'http://tabela-cursos.herokuapp.com/index.html'
cursos = pd.read_html(url)
cursos

# se o serviço acima estiver indisponível, use o código abaixo:
# cursos = [pd.read_csv('../data/cursos.csv')]

[                          Nome do curso
 0                 Lógica de programação
 1                         Java para Web
 2                           C# para Web
 3                         Ruby on Rails
 4                      Cursos de Python
 5                         PHP com MySql
 6                         .NET para web
 7            Novas integrações com Java
 8                          TDD com Java
 9                   Código limpo com C#
 10  Preparatório para certificação Java
 11                      Hardware básico
 12                Persistência com .NET
 13                  Desenvolvendo jogos
 14                     Análise de dados
 15                   Estatística básica
 16                  Internet das coisas
 17                Programação funcional
 18                Boas práticas em Java
 19          Orientação objetos com Java]

In [61]:
# O tipo retornado por read_html é um lista de DataFrames
type(cursos)

list

In [62]:
len(cursos)

1

In [63]:
cursos = cursos[0]

In [64]:
cursos

                          Nome do curso
0                 Lógica de programação
1                         Java para Web
2                           C# para Web
3                         Ruby on Rails
4                      Cursos de Python
5                         PHP com MySql
6                         .NET para web
7            Novas integrações com Java
8                          TDD com Java
9                   Código limpo com C#
10  Preparatório para certificação Java
11                      Hardware básico
12                Persistência com .NET
13                  Desenvolvendo jogos
14                     Análise de dados
15                   Estatística básica
16                  Internet das coisas
17                Programação funcional
18                Boas práticas em Java
19          Orientação objetos com Java

In [65]:
type(cursos)

pandas.core.frame.DataFrame

In [66]:
cursos.head()

           Nome do curso
0  Lógica de programação
1          Java para Web
2            C# para Web
3          Ruby on Rails
4       Cursos de Python

## Alterando o index de cursos

In [67]:
cursos.rename(columns={'Nome do curso': 'nome_do_curso'}, inplace=True)

In [68]:
cursos.head(5)

           nome_do_curso
0  Lógica de programação
1          Java para Web
2            C# para Web
3          Ruby on Rails
4       Cursos de Python

In [69]:
cursos['id'] = cursos.index + 1

In [70]:
cursos.head()

           nome_do_curso  id
0  Lógica de programação   1
1          Java para Web   2
2            C# para Web   3
3          Ruby on Rails   4
4       Cursos de Python   5

In [71]:
cursos.set_index('id', inplace=True)

In [72]:
cursos.head()

            nome_do_curso
id
1   Lógica de programação
2           Java para Web
3             C# para Web
4           Ruby on Rails
5        Cursos de Python

## Matriculando os alunos nos cursos

In [ ]:
nomes['matriculas'] = np.ceil(
    np.random.exponential(size=total_alunos) * 1.5
).astype(int)

In [ ]:
nomes.sample(5)

In [ ]:
nomes.matriculas.describe()